/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：Led.c
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：
* 作    者：lhb Steven
* 完成日期：2016/4/15
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#include "Led.h"
#define LED_SWITCH  PD_ODR_ODR4 
/**********************************************函数定义***************************************************** 
* 函数名称: void LedInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: csh  
* 作    者: by lhb_steven
* 日    期: 2016/4/15
************************************************************************************************************/ 
void LedInit(void) { 
    PD_DDR_DDR4 = 1;
    PD_CR1_C14 = 1;
    PD_CR2_C24 = 0;
    
    LedSet(1);
}
/**********************************************函数定义***************************************************** 
* 函数名称: void LedSet(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: sz  
* 作    者: by lhb_steven
* 日    期: 2016/4/15
************************************************************************************************************/ 
void LedSet(u8 cmd) { 
    LED_SWITCH = cmd;
}






